Blitz-Motors/BLE/nRF5_SDK_Current/examples/myExample/ble_app_uart/main.c
static uint8_t counter = 0;
#define BLE_INT_PIN_NUMBER          14
#define BLE_ENTER_SLEEP_MODE_PIN_4   4
#define BLE_GPIO_OO5_EXIT_SLEEP_MODE 5


#define SYSTEM_CONFIGURATIOM      20               //output
#define BLE_RESET                 21               //output
#define USER_BUTTON               18               //input
#define UART_TX_SIGNAL            16               //output
#define UART_RX_SIGNAL            12               //input


#define CHECK_DELAY_INTERRUPT_MS 100
#define CHECK_DELAY_EXIT_SLEEP_MODE 100

APP_TIMER_DEF(my_delay_timer_id);
APP_TIMER_DEF(my_timer_id);
APP_TIMER_DEF(my_timer_interrupt);
APP_TIMER_DEF(my_timer_exit_sleep_mode);


// Interrupt handler for the GPIO pin
static void pin_state_change_handler(nrfx_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
    // Check if the pin is high
    if (nrf_gpio_pin_read(pin) == 1){
        uint32_t err_code = app_timer_start(my_timer_interrupt, APP_TIMER_TICKS(CHECK_DELAY_INTERRUPT_MS), NULL);
        APP_ERROR_CHECK(err_code);
    }
}

// Interrupt handler for the GPIO pin
static void pin_state_exit_sleep_mode_handler(nrfx_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
    // Check if the pin is high
    if (nrf_gpio_pin_read(pin) == 1){
        uint32_t err_code = app_timer_start(my_timer_exit_sleep_mode, APP_TIMER_TICKS(CHECK_DELAY_EXIT_SLEEP_MODE), NULL);
        APP_ERROR_CHECK(err_code);
    }
}

static void gpio_init_Interrupt_pin(void)
{
    // Initialize GPIOTE driver
    ret_code_t err_code = nrfx_gpiote_init();
    APP_ERROR_CHECK(err_code);

    // Configure the GPIO pin as input with pull-up and sense for high level
    nrfx_gpiote_in_config_t in_config = NRFX_GPIOTE_CONFIG_IN_SENSE_LOTOHI(true);
    in_config.pull = NRF_GPIO_PIN_NOPULL;

    // Initialize the input pin with the configured settings
    err_code = nrfx_gpiote_in_init(BLE_ENTER_SLEEP_MODE_PIN_4, &in_config, pin_state_change_handler);
    APP_ERROR_CHECK(err_code);

    // Enable the input pin event
    nrfx_gpiote_in_event_enable(BLE_ENTER_SLEEP_MODE_PIN_4, true);
}

static void InitGeneralGpio()
{
    // Configure the wake-up pin
    nrf_gpio_cfg_output(SYSTEM_CONFIGURATIOM);
    nrf_gpio_pin_set(SYSTEM_CONFIGURATIOM);
    nrf_gpio_cfg_output(BLE_GPIO_OO5_EXIT_SLEEP_MODE);
    nrf_gpio_pin_clear(BLE_GPIO_OO5_EXIT_SLEEP_MODE);
    nrf_gpio_cfg_input(BLE_RESET, NRF_GPIO_PIN_PULLUP);
}

static void InitBleGpio(uint32_t pinNumber)
{
    nrf_gpio_cfg_output(pinNumber);
    nrf_gpio_pin_set(pinNumber);
}


/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for initializing the timer module.
 */

static void delay_timer_handler(void * p_context) {
    nrf_gpio_pin_set(BLE_INT_PIN_NUMBER);
}

static void delay_timer__interrupt_handler(void * p_context) {
    // Read the pin state after the delay
    if (nrf_gpio_pin_read(BLE_ENTER_SLEEP_MODE_PIN_4) == 1)
    {
        // Configure the pin as a wake-up source
        nrf_gpio_pin_set(BLE_GPIO_OO5_EXIT_SLEEP_MODE);
        
        sd_power_system_off(); 
    }
}

static void timer_timeout_handler(void * p_context){
    const uint8_t clearCounter = 7;
    if(counter == clearCounter){
        counter = 0;
        nrf_gpio_pin_clear(BLE_INT_PIN_NUMBER);
        app_timer_start(my_delay_timer_id, APP_TIMER_TICKS(500), NULL);  // Assuming my_delay_timer_id is another timer configured for one-shot delay
    }
  else{
    counter++;
  }
}


static void timers_init(void)
{
    ret_code_t err_code;
    // Initialize the app timer module.
    err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    // Create a repeated timer.
    err_code = app_timer_create(&my_timer_id, APP_TIMER_MODE_REPEATED, timer_timeout_handler);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create(&my_delay_timer_id, APP_TIMER_MODE_SINGLE_SHOT, delay_timer_handler);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create(&my_timer_interrupt, APP_TIMER_MODE_SINGLE_SHOT, delay_timer__interrupt_handler);
    APP_ERROR_CHECK(err_code);

    uint32_t time_ms = 30 * 60 *  1000;  // 30 minutes in milliseconds
    uint32_t time_ticks = APP_TIMER_TICKS(time_ms);

    // Start the timer with the defined duration.
    err_code = app_timer_start(my_timer_id, time_ticks, NULL);  // NULL for p_context if not used
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t * p_evt)
{

    if (p_evt->type == BLE_NUS_EVT_RX_DATA)
    {
        uint32_t err_code;

        NRF_LOG_DEBUG("Received data from BLE NUS. Writing data on UART.");
        NRF_LOG_HEXDUMP_DEBUG(p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);

        for (uint32_t i = 0; i < p_evt->params.rx_data.length; i++)
        {
            do
            {
                err_code = app_uart_put(p_evt->params.rx_data.p_data[i]);
                if ((err_code != NRF_SUCCESS) && (err_code != NRF_ERROR_BUSY))
                {
                    NRF_LOG_ERROR("Failed receiving NUS message. Error 0x%x. ", err_code);
                    APP_ERROR_CHECK(err_code);
                }
            } while (err_code == NRF_ERROR_BUSY);
        }
        if (p_evt->params.rx_data.p_data[p_evt->params.rx_data.length - 1] == '\r')
        {
            while (app_uart_put('\n') == NRF_ERROR_BUSY);
        }
    }

